TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gpioa.h
/* GPIOA_DIN3_0 Bits */
/* GPIOA_DIN3_0[DIO0] Bits */
#define GPIOA_DIN3_0_DIO0_OFS                    (0)                             /* !< DIO0 Offset */
#define GPIOA_DIN3_0_DIO0_MASK                   ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of DIO0. */
#define GPIOA_DIN3_0_DIO0_ZERO                   ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN3_0_DIO0_ONE                    ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* GPIOA_DIN3_0[DIO1] Bits */
#define GPIOA_DIN3_0_DIO1_OFS                    (8)                             /* !< DIO1 Offset */
#define GPIOA_DIN3_0_DIO1_MASK                   ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of DIO1. */
#define GPIOA_DIN3_0_DIO1_ZERO                   ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN3_0_DIO1_ONE                    ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* GPIOA_DIN3_0[DIO2] Bits */
#define GPIOA_DIN3_0_DIO2_OFS                    (16)                            /* !< DIO2 Offset */
#define GPIOA_DIN3_0_DIO2_MASK                   ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of DIO2. */
#define GPIOA_DIN3_0_DIO2_ZERO                   ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN3_0_DIO2_ONE                    ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* GPIOA_DIN3_0[DIO3] Bits */
#define GPIOA_DIN3_0_DIO3_OFS                    (24)                            /* !< DIO3 Offset */
#define GPIOA_DIN3_0_DIO3_MASK                   ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of DIO3. */
#define GPIOA_DIN3_0_DIO3_ZERO                   ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN3_0_DIO3_ONE                    ((uint32_t)0x01000000U)         /* !< Input value is 1 */

/* GPIOA_DIN7_4 Bits */
/* GPIOA_DIN7_4[DIO4] Bits */
#define GPIOA_DIN7_4_DIO4_OFS                    (0)                             /* !< DIO4 Offset */
#define GPIOA_DIN7_4_DIO4_MASK                   ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of DIO4. */
#define GPIOA_DIN7_4_DIO4_ZERO                   ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN7_4_DIO4_ONE                    ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* GPIOA_DIN7_4[DIO5] Bits */
#define GPIOA_DIN7_4_DIO5_OFS                    (8)                             /* !< DIO5 Offset */
#define GPIOA_DIN7_4_DIO5_MASK                   ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of DIO5. */
#define GPIOA_DIN7_4_DIO5_ZERO                   ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN7_4_DIO5_ONE                    ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* GPIOA_DIN7_4[DIO6] Bits */
#define GPIOA_DIN7_4_DIO6_OFS                    (16)                            /* !< DIO6 Offset */
#define GPIOA_DIN7_4_DIO6_MASK                   ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of DIO6. */
#define GPIOA_DIN7_4_DIO6_ZERO                   ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN7_4_DIO6_ONE                    ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* GPIOA_DIN7_4[DIO7] Bits */
#define GPIOA_DIN7_4_DIO7_OFS                    (24)                            /* !< DIO7 Offset */
#define GPIOA_DIN7_4_DIO7_MASK                   ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of DIO7. */
#define GPIOA_DIN7_4_DIO7_ZERO                   ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN7_4_DIO7_ONE                    ((uint32_t)0x01000000U)         /* !< Input value is 1 */

/* GPIOA_DIN11_8 Bits */
/* GPIOA_DIN11_8[DIO8] Bits */
#define GPIOA_DIN11_8_DIO8_OFS                   (0)                             /* !< DIO8 Offset */
#define GPIOA_DIN11_8_DIO8_MASK                  ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of DIO8. */
#define GPIOA_DIN11_8_DIO8_ZERO                  ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN11_8_DIO8_ONE                   ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* GPIOA_DIN11_8[DIO9] Bits */
#define GPIOA_DIN11_8_DIO9_OFS                   (8)                             /* !< DIO9 Offset */
#define GPIOA_DIN11_8_DIO9_MASK                  ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of DIO9. */
#define GPIOA_DIN11_8_DIO9_ZERO                  ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN11_8_DIO9_ONE                   ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* GPIOA_DIN11_8[DIO10] Bits */
#define GPIOA_DIN11_8_DIO10_OFS                  (16)                            /* !< DIO10 Offset */
#define GPIOA_DIN11_8_DIO10_MASK                 ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of DIO10. */
#define GPIOA_DIN11_8_DIO10_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN11_8_DIO10_ONE                  ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* GPIOA_DIN11_8[DIO11] Bits */
#define GPIOA_DIN11_8_DIO11_OFS                  (24)                            /* !< DIO11 Offset */
#define GPIOA_DIN11_8_DIO11_MASK                 ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of DIO11. */
#define GPIOA_DIN11_8_DIO11_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN11_8_DIO11_ONE                  ((uint32_t)0x01000000U)         /* !< Input value is 1 */

