TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gpioa.h
/* GPIOA_DIN15_12 Bits */
/* GPIOA_DIN15_12[DIO12] Bits */
#define GPIOA_DIN15_12_DIO12_OFS                 (0)                             /* !< DIO12 Offset */
#define GPIOA_DIN15_12_DIO12_MASK                ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of DIO12. */
#define GPIOA_DIN15_12_DIO12_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN15_12_DIO12_ONE                 ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* GPIOA_DIN15_12[DIO13] Bits */
#define GPIOA_DIN15_12_DIO13_OFS                 (8)                             /* !< DIO13 Offset */
#define GPIOA_DIN15_12_DIO13_MASK                ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of DIO13. */
#define GPIOA_DIN15_12_DIO13_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN15_12_DIO13_ONE                 ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* GPIOA_DIN15_12[DIO14] Bits */
#define GPIOA_DIN15_12_DIO14_OFS                 (16)                            /* !< DIO14 Offset */
#define GPIOA_DIN15_12_DIO14_MASK                ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of DIO14. */
#define GPIOA_DIN15_12_DIO14_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN15_12_DIO14_ONE                 ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* GPIOA_DIN15_12[DIO15] Bits */
#define GPIOA_DIN15_12_DIO15_OFS                 (24)                            /* !< DIO15 Offset */
#define GPIOA_DIN15_12_DIO15_MASK                ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of DIO15. */
#define GPIOA_DIN15_12_DIO15_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN15_12_DIO15_ONE                 ((uint32_t)0x01000000U)         /* !< Input value is 1 */

/* GPIOA_DIN19_16 Bits */
/* GPIOA_DIN19_16[DIO16] Bits */
#define GPIOA_DIN19_16_DIO16_OFS                 (0)                             /* !< DIO16 Offset */
#define GPIOA_DIN19_16_DIO16_MASK                ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of DIO16. */
#define GPIOA_DIN19_16_DIO16_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN19_16_DIO16_ONE                 ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* GPIOA_DIN19_16[DIO17] Bits */
#define GPIOA_DIN19_16_DIO17_OFS                 (8)                             /* !< DIO17 Offset */
#define GPIOA_DIN19_16_DIO17_MASK                ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of DIO17. */
#define GPIOA_DIN19_16_DIO17_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN19_16_DIO17_ONE                 ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* GPIOA_DIN19_16[DIO18] Bits */
#define GPIOA_DIN19_16_DIO18_OFS                 (16)                            /* !< DIO18 Offset */
#define GPIOA_DIN19_16_DIO18_MASK                ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of DIO18. */
#define GPIOA_DIN19_16_DIO18_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN19_16_DIO18_ONE                 ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* GPIOA_DIN19_16[DIO19] Bits */
#define GPIOA_DIN19_16_DIO19_OFS                 (24)                            /* !< DIO19 Offset */
#define GPIOA_DIN19_16_DIO19_MASK                ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of DIO19. */
#define GPIOA_DIN19_16_DIO19_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN19_16_DIO19_ONE                 ((uint32_t)0x01000000U)         /* !< Input value is 1 */

/* GPIOA_DIN23_20 Bits */
/* GPIOA_DIN23_20[DIO20] Bits */
#define GPIOA_DIN23_20_DIO20_OFS                 (0)                             /* !< DIO20 Offset */
#define GPIOA_DIN23_20_DIO20_MASK                ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of DIO20. */
#define GPIOA_DIN23_20_DIO20_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN23_20_DIO20_ONE                 ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* GPIOA_DIN23_20[DIO21] Bits */
#define GPIOA_DIN23_20_DIO21_OFS                 (8)                             /* !< DIO21 Offset */
#define GPIOA_DIN23_20_DIO21_MASK                ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of DIO21. */
#define GPIOA_DIN23_20_DIO21_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN23_20_DIO21_ONE                 ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* GPIOA_DIN23_20[DIO22] Bits */
#define GPIOA_DIN23_20_DIO22_OFS                 (16)                            /* !< DIO22 Offset */
#define GPIOA_DIN23_20_DIO22_MASK                ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of DIO22. */
#define GPIOA_DIN23_20_DIO22_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN23_20_DIO22_ONE                 ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* GPIOA_DIN23_20[DIO23] Bits */
#define GPIOA_DIN23_20_DIO23_OFS                 (24)                            /* !< DIO23 Offset */
#define GPIOA_DIN23_20_DIO23_MASK                ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of DIO23. */
#define GPIOA_DIN23_20_DIO23_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN23_20_DIO23_ONE                 ((uint32_t)0x01000000U)         /* !< Input value is 1 */

