TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_gpioa.h
/* GPIOA_DIN27_24 Bits */
/* GPIOA_DIN27_24[DIO24] Bits */
#define GPIOA_DIN27_24_DIO24_OFS                 (0)                             /* !< DIO24 Offset */
#define GPIOA_DIN27_24_DIO24_MASK                ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of DIO24. */
#define GPIOA_DIN27_24_DIO24_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN27_24_DIO24_ONE                 ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* GPIOA_DIN27_24[DIO25] Bits */
#define GPIOA_DIN27_24_DIO25_OFS                 (8)                             /* !< DIO25 Offset */
#define GPIOA_DIN27_24_DIO25_MASK                ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of DIO25. */
#define GPIOA_DIN27_24_DIO25_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN27_24_DIO25_ONE                 ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* GPIOA_DIN27_24[DIO26] Bits */
#define GPIOA_DIN27_24_DIO26_OFS                 (16)                            /* !< DIO26 Offset */
#define GPIOA_DIN27_24_DIO26_MASK                ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of DIO26. */
#define GPIOA_DIN27_24_DIO26_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN27_24_DIO26_ONE                 ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* GPIOA_DIN27_24[DIO27] Bits */
#define GPIOA_DIN27_24_DIO27_OFS                 (24)                            /* !< DIO27 Offset */
#define GPIOA_DIN27_24_DIO27_MASK                ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of DIO27. */
#define GPIOA_DIN27_24_DIO27_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN27_24_DIO27_ONE                 ((uint32_t)0x01000000U)         /* !< Input value is 1 */

/* GPIOA_DIN31_28 Bits */
/* GPIOA_DIN31_28[DIO28] Bits */
#define GPIOA_DIN31_28_DIO28_OFS                 (0)                             /* !< DIO28 Offset */
#define GPIOA_DIN31_28_DIO28_MASK                ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of DIO28. */
#define GPIOA_DIN31_28_DIO28_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_28_DIO28_ONE                 ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* GPIOA_DIN31_28[DIO29] Bits */
#define GPIOA_DIN31_28_DIO29_OFS                 (8)                             /* !< DIO29 Offset */
#define GPIOA_DIN31_28_DIO29_MASK                ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of DIO29. */
#define GPIOA_DIN31_28_DIO29_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_28_DIO29_ONE                 ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* GPIOA_DIN31_28[DIO30] Bits */
#define GPIOA_DIN31_28_DIO30_OFS                 (16)                            /* !< DIO30 Offset */
#define GPIOA_DIN31_28_DIO30_MASK                ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of DIO30. */
#define GPIOA_DIN31_28_DIO30_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_28_DIO30_ONE                 ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* GPIOA_DIN31_28[DIO31] Bits */
#define GPIOA_DIN31_28_DIO31_OFS                 (24)                            /* !< DIO31 Offset */
#define GPIOA_DIN31_28_DIO31_MASK                ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of DIO31. */
#define GPIOA_DIN31_28_DIO31_ZERO                ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_28_DIO31_ONE                 ((uint32_t)0x01000000U)         /* !< Input value is 1 */

/* GPIOA_DIN31_0 Bits */
/* GPIOA_DIN31_0[DIO0] Bits */
#define GPIOA_DIN31_0_DIO0_OFS                   (0)                             /* !< DIO0 Offset */
#define GPIOA_DIN31_0_DIO0_MASK                  ((uint32_t)0x00000001U)         /* !< This bit reads the data input value
                                                                                    of DIO0. */
#define GPIOA_DIN31_0_DIO0_ZERO                  ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO0_ONE                   ((uint32_t)0x00000001U)         /* !< Input value is 1 */
/* GPIOA_DIN31_0[DIO1] Bits */
#define GPIOA_DIN31_0_DIO1_OFS                   (1)                             /* !< DIO1 Offset */
#define GPIOA_DIN31_0_DIO1_MASK                  ((uint32_t)0x00000002U)         /* !< This bit reads the data input value
                                                                                    of DIO1. */
#define GPIOA_DIN31_0_DIO1_ZERO                  ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO1_ONE                   ((uint32_t)0x00000002U)         /* !< Input value is 1 */
/* GPIOA_DIN31_0[DIO2] Bits */
#define GPIOA_DIN31_0_DIO2_OFS                   (2)                             /* !< DIO2 Offset */
#define GPIOA_DIN31_0_DIO2_MASK                  ((uint32_t)0x00000004U)         /* !< This bit reads the data input value
                                                                                    of DIO2. */
#define GPIOA_DIN31_0_DIO2_ZERO                  ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO2_ONE                   ((uint32_t)0x00000004U)         /* !< Input value is 1 */
/* GPIOA_DIN31_0[DIO3] Bits */
#define GPIOA_DIN31_0_DIO3_OFS                   (3)                             /* !< DIO3 Offset */
#define GPIOA_DIN31_0_DIO3_MASK                  ((uint32_t)0x00000008U)         /* !< This bit reads the data input value
                                                                                    of DIO3. */
#define GPIOA_DIN31_0_DIO3_ZERO                  ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO3_ONE                   ((uint32_t)0x00000008U)         /* !< Input value is 1 */
/* GPIOA_DIN31_0[DIO4] Bits */
#define GPIOA_DIN31_0_DIO4_OFS                   (4)                             /* !< DIO4 Offset */
#define GPIOA_DIN31_0_DIO4_MASK                  ((uint32_t)0x00000010U)         /* !< This bit reads the data input value
                                                                                    of DIO4. */
#define GPIOA_DIN31_0_DIO4_ZERO                  ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO4_ONE                   ((uint32_t)0x00000010U)         /* !< Input value is 1 */
/* GPIOA_DIN31_0[DIO5] Bits */
#define GPIOA_DIN31_0_DIO5_OFS                   (5)                             /* !< DIO5 Offset */
#define GPIOA_DIN31_0_DIO5_MASK                  ((uint32_t)0x00000020U)         /* !< This bit reads the data input value
                                                                                    of DIO5. */
#define GPIOA_DIN31_0_DIO5_ZERO                  ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO5_ONE                   ((uint32_t)0x00000020U)         /* !< Input value is 1 */
/* GPIOA_DIN31_0[DIO6] Bits */
#define GPIOA_DIN31_0_DIO6_OFS                   (6)                             /* !< DIO6 Offset */
#define GPIOA_DIN31_0_DIO6_MASK                  ((uint32_t)0x00000040U)         /* !< This bit reads the data input value
                                                                                    of DIO6. */
#define GPIOA_DIN31_0_DIO6_ZERO                  ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO6_ONE                   ((uint32_t)0x00000040U)         /* !< Input value is 1 */
/* GPIOA_DIN31_0[DIO7] Bits */
#define GPIOA_DIN31_0_DIO7_OFS                   (7)                             /* !< DIO7 Offset */
#define GPIOA_DIN31_0_DIO7_MASK                  ((uint32_t)0x00000080U)         /* !< This bit reads the data input value
                                                                                    of DIO7. */
#define GPIOA_DIN31_0_DIO7_ZERO                  ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO7_ONE                   ((uint32_t)0x00000080U)         /* !< Input value is 1 */
/* GPIOA_DIN31_0[DIO8] Bits */
#define GPIOA_DIN31_0_DIO8_OFS                   (8)                             /* !< DIO8 Offset */
#define GPIOA_DIN31_0_DIO8_MASK                  ((uint32_t)0x00000100U)         /* !< This bit reads the data input value
                                                                                    of DIO8. */
#define GPIOA_DIN31_0_DIO8_ZERO                  ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO8_ONE                   ((uint32_t)0x00000100U)         /* !< Input value is 1 */
/* GPIOA_DIN31_0[DIO9] Bits */
#define GPIOA_DIN31_0_DIO9_OFS                   (9)                             /* !< DIO9 Offset */
#define GPIOA_DIN31_0_DIO9_MASK                  ((uint32_t)0x00000200U)         /* !< This bit reads the data input value
                                                                                    of DIO9. */
#define GPIOA_DIN31_0_DIO9_ZERO                  ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO9_ONE                   ((uint32_t)0x00000200U)         /* !< Input value is 1 */
/* GPIOA_DIN31_0[DIO10] Bits */
#define GPIOA_DIN31_0_DIO10_OFS                  (10)                            /* !< DIO10 Offset */
#define GPIOA_DIN31_0_DIO10_MASK                 ((uint32_t)0x00000400U)         /* !< This bit reads the data input value
                                                                                    of DIO10. */
#define GPIOA_DIN31_0_DIO10_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO10_ONE                  ((uint32_t)0x00000400U)         /* !< Input value is 1 */
/* GPIOA_DIN31_0[DIO11] Bits */
#define GPIOA_DIN31_0_DIO11_OFS                  (11)                            /* !< DIO11 Offset */
#define GPIOA_DIN31_0_DIO11_MASK                 ((uint32_t)0x00000800U)         /* !< This bit reads the data input value
                                                                                    of DIO11. */
#define GPIOA_DIN31_0_DIO11_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO11_ONE                  ((uint32_t)0x00000800U)         /* !< Input value is 1 */
/* GPIOA_DIN31_0[DIO12] Bits */
#define GPIOA_DIN31_0_DIO12_OFS                  (12)                            /* !< DIO12 Offset */
#define GPIOA_DIN31_0_DIO12_MASK                 ((uint32_t)0x00001000U)         /* !< This bit reads the data input value
                                                                                    of DIO12. */
#define GPIOA_DIN31_0_DIO12_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO12_ONE                  ((uint32_t)0x00001000U)         /* !< Input value is 1 */
/* GPIOA_DIN31_0[DIO13] Bits */
#define GPIOA_DIN31_0_DIO13_OFS                  (13)                            /* !< DIO13 Offset */
#define GPIOA_DIN31_0_DIO13_MASK                 ((uint32_t)0x00002000U)         /* !< This bit reads the data input value
                                                                                    of DIO13. */
#define GPIOA_DIN31_0_DIO13_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO13_ONE                  ((uint32_t)0x00002000U)         /* !< Input value is 1 */
/* GPIOA_DIN31_0[DIO14] Bits */
#define GPIOA_DIN31_0_DIO14_OFS                  (14)                            /* !< DIO14 Offset */
#define GPIOA_DIN31_0_DIO14_MASK                 ((uint32_t)0x00004000U)         /* !< This bit reads the data input value
                                                                                    of DIO14. */
#define GPIOA_DIN31_0_DIO14_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO14_ONE                  ((uint32_t)0x00004000U)         /* !< Input value is 1 */
/* GPIOA_DIN31_0[DIO15] Bits */
#define GPIOA_DIN31_0_DIO15_OFS                  (15)                            /* !< DIO15 Offset */
#define GPIOA_DIN31_0_DIO15_MASK                 ((uint32_t)0x00008000U)         /* !< This bit reads the data input value
                                                                                    of DIO15. */
#define GPIOA_DIN31_0_DIO15_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO15_ONE                  ((uint32_t)0x00008000U)         /* !< Input value is 1 */
/* GPIOA_DIN31_0[DIO16] Bits */
#define GPIOA_DIN31_0_DIO16_OFS                  (16)                            /* !< DIO16 Offset */
#define GPIOA_DIN31_0_DIO16_MASK                 ((uint32_t)0x00010000U)         /* !< This bit reads the data input value
                                                                                    of DIO16. */
#define GPIOA_DIN31_0_DIO16_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO16_ONE                  ((uint32_t)0x00010000U)         /* !< Input value is 1 */
/* GPIOA_DIN31_0[DIO17] Bits */
#define GPIOA_DIN31_0_DIO17_OFS                  (17)                            /* !< DIO17 Offset */
#define GPIOA_DIN31_0_DIO17_MASK                 ((uint32_t)0x00020000U)         /* !< This bit reads the data input value
                                                                                    of DIO17. */
#define GPIOA_DIN31_0_DIO17_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO17_ONE                  ((uint32_t)0x00020000U)         /* !< Input value is 1 */
/* GPIOA_DIN31_0[DIO18] Bits */
#define GPIOA_DIN31_0_DIO18_OFS                  (18)                            /* !< DIO18 Offset */
#define GPIOA_DIN31_0_DIO18_MASK                 ((uint32_t)0x00040000U)         /* !< This bit reads the data input value
                                                                                    of DIO18. */
#define GPIOA_DIN31_0_DIO18_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO18_ONE                  ((uint32_t)0x00040000U)         /* !< Input value is 1 */
/* GPIOA_DIN31_0[DIO19] Bits */
#define GPIOA_DIN31_0_DIO19_OFS                  (19)                            /* !< DIO19 Offset */
#define GPIOA_DIN31_0_DIO19_MASK                 ((uint32_t)0x00080000U)         /* !< This bit reads the data input value
                                                                                    of DIO19. */
#define GPIOA_DIN31_0_DIO19_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO19_ONE                  ((uint32_t)0x00080000U)         /* !< Input value is 1 */
/* GPIOA_DIN31_0[DIO20] Bits */
#define GPIOA_DIN31_0_DIO20_OFS                  (20)                            /* !< DIO20 Offset */
#define GPIOA_DIN31_0_DIO20_MASK                 ((uint32_t)0x00100000U)         /* !< This bit reads the data input value
                                                                                    of DIO20. */
#define GPIOA_DIN31_0_DIO20_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO20_ONE                  ((uint32_t)0x00100000U)         /* !< Input value is 1 */
/* GPIOA_DIN31_0[DIO21] Bits */
#define GPIOA_DIN31_0_DIO21_OFS                  (21)                            /* !< DIO21 Offset */
#define GPIOA_DIN31_0_DIO21_MASK                 ((uint32_t)0x00200000U)         /* !< This bit reads the data input value
                                                                                    of DIO21. */
#define GPIOA_DIN31_0_DIO21_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO21_ONE                  ((uint32_t)0x00200000U)         /* !< Input value is 1 */
/* GPIOA_DIN31_0[DIO22] Bits */
#define GPIOA_DIN31_0_DIO22_OFS                  (22)                            /* !< DIO22 Offset */
#define GPIOA_DIN31_0_DIO22_MASK                 ((uint32_t)0x00400000U)         /* !< This bit reads the data input value
                                                                                    of DIO22. */
#define GPIOA_DIN31_0_DIO22_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO22_ONE                  ((uint32_t)0x00400000U)         /* !< Input value is 1 */
/* GPIOA_DIN31_0[DIO23] Bits */
#define GPIOA_DIN31_0_DIO23_OFS                  (23)                            /* !< DIO23 Offset */
#define GPIOA_DIN31_0_DIO23_MASK                 ((uint32_t)0x00800000U)         /* !< This bit reads the data input value
                                                                                    of DIO23. */
#define GPIOA_DIN31_0_DIO23_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO23_ONE                  ((uint32_t)0x00800000U)         /* !< Input value is 1 */
/* GPIOA_DIN31_0[DIO24] Bits */
#define GPIOA_DIN31_0_DIO24_OFS                  (24)                            /* !< DIO24 Offset */
#define GPIOA_DIN31_0_DIO24_MASK                 ((uint32_t)0x01000000U)         /* !< This bit reads the data input value
                                                                                    of DIO24. */
#define GPIOA_DIN31_0_DIO24_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO24_ONE                  ((uint32_t)0x01000000U)         /* !< Input value is 1 */
/* GPIOA_DIN31_0[DIO25] Bits */
#define GPIOA_DIN31_0_DIO25_OFS                  (25)                            /* !< DIO25 Offset */
#define GPIOA_DIN31_0_DIO25_MASK                 ((uint32_t)0x02000000U)         /* !< This bit reads the data input value
                                                                                    of DIO25. */
#define GPIOA_DIN31_0_DIO25_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO25_ONE                  ((uint32_t)0x02000000U)         /* !< Input value is 1 */
/* GPIOA_DIN31_0[DIO26] Bits */
#define GPIOA_DIN31_0_DIO26_OFS                  (26)                            /* !< DIO26 Offset */
#define GPIOA_DIN31_0_DIO26_MASK                 ((uint32_t)0x04000000U)         /* !< This bit reads the data input value
                                                                                    of DIO26. */
#define GPIOA_DIN31_0_DIO26_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO26_ONE                  ((uint32_t)0x04000000U)         /* !< Input value is 1 */
/* GPIOA_DIN31_0[DIO27] Bits */
#define GPIOA_DIN31_0_DIO27_OFS                  (27)                            /* !< DIO27 Offset */
#define GPIOA_DIN31_0_DIO27_MASK                 ((uint32_t)0x08000000U)         /* !< This bit reads the data input value
                                                                                    of DIO27. */
#define GPIOA_DIN31_0_DIO27_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO27_ONE                  ((uint32_t)0x08000000U)         /* !< Input value is 1 */
/* GPIOA_DIN31_0[DIO28] Bits */
#define GPIOA_DIN31_0_DIO28_OFS                  (28)                            /* !< DIO28 Offset */
#define GPIOA_DIN31_0_DIO28_MASK                 ((uint32_t)0x10000000U)         /* !< This bit reads the data input value
                                                                                    of DIO28. */
#define GPIOA_DIN31_0_DIO28_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO28_ONE                  ((uint32_t)0x10000000U)         /* !< Input value is 1 */
/* GPIOA_DIN31_0[DIO29] Bits */
#define GPIOA_DIN31_0_DIO29_OFS                  (29)                            /* !< DIO29 Offset */
#define GPIOA_DIN31_0_DIO29_MASK                 ((uint32_t)0x20000000U)         /* !< This bit reads the data input value
                                                                                    of DIO29. */
#define GPIOA_DIN31_0_DIO29_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO29_ONE                  ((uint32_t)0x20000000U)         /* !< Input value is 1 */
/* GPIOA_DIN31_0[DIO30] Bits */
#define GPIOA_DIN31_0_DIO30_OFS                  (30)                            /* !< DIO30 Offset */
#define GPIOA_DIN31_0_DIO30_MASK                 ((uint32_t)0x40000000U)         /* !< This bit reads the data input value
                                                                                    of DIO30. */
#define GPIOA_DIN31_0_DIO30_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO30_ONE                  ((uint32_t)0x40000000U)         /* !< Input value is 1 */
/* GPIOA_DIN31_0[DIO31] Bits */
#define GPIOA_DIN31_0_DIO31_OFS                  (31)                            /* !< DIO31 Offset */
#define GPIOA_DIN31_0_DIO31_MASK                 ((uint32_t)0x80000000U)         /* !< This bit reads the data input value
                                                                                    of DIO31. */
#define GPIOA_DIN31_0_DIO31_ZERO                 ((uint32_t)0x00000000U)         /* !< Input value is 0 */
#define GPIOA_DIN31_0_DIO31_ONE                  ((uint32_t)0x80000000U)         /* !< Input value is 1 */

